TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HCDC/BDF_BCDF_USB_HCDC_CK_RX65N_V_2/src/smc_gen/r_usb_hcdc/src/r_usb_hcdc_driver.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2014(2023) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hcdc_driver.c
 * Description  : USB Host CDC Driver
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 08.01.2014 1.00 First Release
 *         : 26.12.2014 1.10 RX71M is added
 *         : 30.09.2015 1.11 RX63N/RX631 is added.
 *         : 30.09.2016 1.20 RX65N/RX651 is added.
 *         : 30.09.2017 1.22 USBA PIPE Buffer size change. "usb_hcdc_serial_state_trans_complete" is deleted.
 *                           Change Function Name "hcdc_read_complete"->"usb_hcdc_read_complete"
 *                           "hcdc_write_complete"->"usb_hcdc_write_complete"
 *         : 31.03.2018 1.23 Supporting Smart Configurator
 *         : 16.11.2018 1.24 Supporting BSP_CFG_RTOS_USED
 *         : 31.05.2019 1.26 Added support for GNUC and ICCRX.
 *         : 01.03.2020 1.30 RX72N/RX66N is added and uITRON is supported.
 *         : 30.09.2023 1.42 USBX HCDC is supported.
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
#include <string.h>

#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_extern.h"
#include "r_usb_bitdefine.h"
#include "r_usb_hcdc_if.h"
#include "r_usb_hcdc.h"

#if defined(USB_CFG_HCDC_USE)
  #if (BSP_CFG_RTOS_USED != 5)    /* !Azure RTOS */

/******************************************************************************
 Private global variables and functions
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED)
uint16_t usb_hcdc_get_string_info(usb_utr_t *mess, uint16_t addr, uint16_t string);
#else
static void usb_hcdc_check_result (usb_utr_t *mess);
#endif  /* (BSP_CFG_RTOS_USED) */
static void usb_hcdc_init (usb_utr_t *ptr, uint16_t data1, uint16_t data2);
/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/

const uint16_t g_usb_hcdc_device_tpl[] =
{
    USB_CFG_TPLCNT, /* Number of tpl table */
    0, /* Reserved */
    USB_CFG_TPL /* Vendor ID, Product ID */
};


int16_t g_usb_hcdc_smpl_class_seq[USB_NUM_USBIP];

uint8_t *g_p_usb_hcdc_device_table[USB_NUM_USBIP];
uint8_t *g_p_usb_hcdc_config_table[USB_NUM_USBIP];
uint8_t *g_p_usb_hcdc_interface_table[USB_NUM_USBIP];
uint16_t g_usb_hcdc_speed[USB_NUM_USBIP];
uint16_t g_usb_hcdc_devaddr[USB_NUM_USBIP];

/******************************************************************************
 Renesas USB Host CDC Driver functions
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_enumeration
 Description     : USB CDC Class Enumeration
 Argument        : usb_utr_t *mess           : Pointer to usb_utr_t structure.
 Return          : none
 ******************************************************************************/
#if (BSP_CFG_RTOS_USED == 0)        /* Non-OS */
void usb_hcdc_enumeration (usb_clsinfo_t *mess)
{
    /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
    uint8_t p_data[32];
    uint16_t j;
#endif  /* defined(USB_DEBUG_ON) */
    uint16_t retval;
    uint8_t string;
    uint8_t *p_desc;
    uint16_t desc_len;

    uint8_t *p_config_desc;

    /* Manager Mode Change */
    switch (g_usb_hcdc_smpl_class_seq[mess->ip])
    {
        case USB_SEQ_0 :

            p_config_desc = g_p_usb_hcdc_config_table[mess->ip];

            if (USB_DT_CONFIGURATION != p_config_desc[1])
            {
                USB_PRINTF0("### Configuration descriptor error !\n");
                usb_hstd_connect_err_event_set(mess->ip);
                return;
            }
            else
            {
                /* String descriptor */
                usb_hstd_get_string_desc(mess, g_usb_hcdc_devaddr[mess->ip], (uint16_t) 0,
                        (usb_cb_t) &usb_hcdc_check_result);
                g_usb_hcdc_smpl_class_seq[mess->ip]++;
            }
        break;

        case USB_SEQ_1 :

            /* String descriptor check */
            if (USB_CTRL_END == mess->result)
            {
                string = g_p_usb_hcdc_device_table[mess->ip][15];

                /* String descriptor */
                usb_hstd_get_string_desc(mess, g_usb_hcdc_devaddr[mess->ip], string, (usb_cb_t) &usb_hcdc_check_result);
                g_usb_hcdc_smpl_class_seq[mess->ip]++;
            }

