TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HCDC/BDF_BCDF_USB_HCDC_CK_RX65N_V_2/src/smc_gen/r_usb_hcdc/src/r_usb_hcdc_driver.c
            else /* USB_ERROR */
            {
                USB_PRINTF0("### Enumeration is stoped(ClassCode-ERROR)\n");
                usb_hstd_return_enu_mgr(mess, USB_ERROR); /* Return to MGR */
                usb_hstd_connect_err_event_set(mess->ip);
            }
        break;

        case USB_SEQ_2 :

            /* String descriptor check */
            if (USB_CTRL_END == mess->result)
            {
                if (g_usb_hstd_class_data[mess->ip][0] < (uint8_t) ((32 * 2) + 2))
                {
                    g_usb_hstd_class_data[mess->ip][0] = (uint8_t) (g_usb_hstd_class_data[mess->ip][0] / 2);
                    g_usb_hstd_class_data[mess->ip][0] = (uint8_t) (g_usb_hstd_class_data[mess->ip][0] - 1);
                }
                else
                {
                    g_usb_hstd_class_data[mess->ip][0] = (uint8_t) 32;
                }

                /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
                for( j = (uint16_t)0; j < g_usb_hstd_class_data[mess->ip][0]; j++ )
                {
                    p_data[j] = g_usb_hstd_class_data[mess->ip][j * (uint16_t)2 + (uint16_t)2];
                }
                p_data[g_usb_hstd_class_data[mess->ip][0]] = 0;
                USB_PRINTF1("  %s\n", p_data);
#endif  /* defined(USB_DEBUG_ON) */
            }
            else
            {
                USB_PRINTF0("*** Product name error\n");
            }

            p_desc = (uint8_t *) g_usb_hstd_config_descriptor[mess->ip];
            desc_len = ((uint16_t) *(p_desc + 3)) << 8;
            desc_len += (uint16_t) *(p_desc + 2);

            /* Pipe Information table set */
            retval = usb_hcdc_pipe_info(mess, p_desc, g_usb_hcdc_speed[mess->ip], desc_len);
            if (USB_ERROR == retval)
            {
                /* Pipe Information table error */
                USB_PRINTF0("### Device information error !\n");
                usb_hstd_connect_err_event_set(mess->ip);
            }
            else
            {
                retval = USB_OK;
            }
            usb_hstd_return_enu_mgr(mess, retval); /* Return to MGR */
        break;

        default:
            g_usb_hcdc_smpl_class_seq[mess->ip] = USB_SEQ_0;
            usb_hstd_return_enu_mgr(mess, USB_ERROR);            /* Return to MGR */
            usb_hstd_connect_err_event_set(mess->ip);
        break;
    }
}
/******************************************************************************
 End of function usb_hcdc_enumeration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_check_result
 Description     : Host CDC class check result
 Argument        : usb_utr_t *mess           : Pointer to usb_utr_t structure.
 Return          : none
 ******************************************************************************/
static void usb_hcdc_check_result (usb_utr_t *mess)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *ptr;

    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HCDC_MPL,&p_blf) == USB_OK)
    {
        ptr = (usb_clsinfo_t*) p_blf;
        ptr->msginfo = USB_MSG_CLS_CHECKREQUEST;
        ptr->keyword = mess->keyword;
        ptr->result = mess->status;
        ptr->ip = mess->ip;
        ptr->ipp = mess->ipp;

        /* Send message */
        err = USB_SND_MSG(USB_HCDC_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HCDC_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### CheckResult function snd_msg(HCDC) error\n");
        }
    }
    else
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }
}
/******************************************************************************
 End of function usb_hcdc_check_result
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hcdc_task
 Description     : CDC Host task
 Argument        : stacd    : Task Start Code
 Return          : none
 ******************************************************************************/
void usb_hcdc_task (rtos_task_arg_t stacd)
{
    usb_utr_t *p_mess;
    usb_er_t err = 0l;

    err = USB_TRCV_MSG(USB_HCDC_MBX, (usb_msg_t** )&p_mess, (uint16_t )3000);
    if (USB_OK == err)
    {
        switch (p_mess->msginfo)
        {
            case USB_MSG_CLS_CHECKREQUEST :
                usb_hcdc_enumeration((usb_clsinfo_t *) p_mess);
                err = USB_REL_BLK(USB_HCDC_MPL, (usb_mh_t )p_mess);
                if (USB_OK != err)
                {
                    USB_PRINTF0("### USB HCDC Task rel_blk error\n");
                }
            break;

            default :
            break;
        }
        err = USB_REL_BLK(USB_HCDC_MPL, (usb_mh_t )p_mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### USB HCDC Task rel_blk error\n");
        }
    }
}
/******************************************************************************
 End of function usb_hcdc_task
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED) */

/******************************************************************************
 Function Name   : usb_hcdc_pipe_info
 Description     : Host Pipe Information check and EP Table Set
 Argument        : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint8_t      *table  : Check Start Descriptor address
                 : uint16_t     speed   : Device connected speed
                 : uint16_t     length  : Configuration Descriptor Length
 Return value    : uint16_t             : USB_OK / USB_ERROR
 ******************************************************************************/
uint16_t usb_hcdc_pipe_info (usb_utr_t *ptr, uint8_t *table, uint16_t speed, uint16_t length)
{
    uint16_t ofdsc;
    uint16_t pipe_no;
    uint16_t in_pipe;
    uint16_t out_pipe;

    usb_pipe_table_reg_t    ep_tbl;

    /* Check Endpoint Descriptor */
    ofdsc = table[0];

    /* Pipe initial */
    in_pipe = USB_NOPIPE;
    out_pipe = USB_NOPIPE;

    /* WAIT_LOOP */
    while (ofdsc < length)
    {
        /* Endpoint Descriptor */
        if ( USB_DT_ENDPOINT == table[ofdsc + USB_EP_B_DESCRIPTORTYPE])
        {
            /* Transfer Type */
            if ( USB_EP_BULK == (table[ofdsc + USB_EP_B_ATTRIBUTES] & USB_EP_TRNSMASK))
            {
                /* Check if transfer direction is IN */
                if ((table[ofdsc + USB_EP_B_ENDPOINTADDRESS] & USB_EP_DIRMASK) == USB_EP_IN)
                {
                    out_pipe = USB_TRUE;
                }
                else
                {
                    in_pipe = USB_TRUE;
                }
            }
            else if ( USB_EP_INT == (table[ofdsc + USB_EP_B_ATTRIBUTES] & USB_EP_TRNSMASK))
            {
                /* None */
            }
            else
            {
                return USB_ERROR;
            }

            /* EP Table pipe Information set */
            pipe_no = usb_hstd_make_pipe_reg_info (ptr->ip, g_usb_hcdc_devaddr[ptr->ip], USB_HCDC, speed, &table[ofdsc], &ep_tbl);
            if ( USB_NULL == pipe_no)
            {
                return USB_ERROR;
            }
            else
            {
                usb_hstd_set_pipe_info (ptr->ip, pipe_no, &ep_tbl);
            }

