TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HCDC/BDF_BCDF_USB_HCDC_CK_RX65N_V_2/src/smc_gen/r_usb_hcdc/src/r_usb_hcdc_driver.c
            if (((USB_NOPIPE != in_pipe) && (USB_NOPIPE != out_pipe)))
            {
                return USB_OK;
            }
        }
        ofdsc += table[ofdsc];
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hcdc_pipe_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_configured
 Description     : Callback function for CDC device configuered
 Argument        : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     devadr  : Device Adrress
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
void usb_hcdc_configured (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    usb_ctrl_t ctrl;

    usb_hcdc_set_pipe_registration(ptr, devadr); /* Host CDC Pipe registration */
    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = devadr;
    ctrl.type = USB_HCDC;
    usb_set_event(USB_STS_CONFIGURED, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hcdc_configured
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_detach
 Description     : Callback function for CDC device detach
 Argument        : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     devadr  : Device Adrress
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
void usb_hcdc_detach (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    usb_ctrl_t ctrl;

    usb_hstd_clr_pipe_table (ptr->ip, devadr);
    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = devadr;
    usb_set_event(USB_STS_DETACH, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hcdc_detach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_read_complete
 Description     : CallBack Function
 Argument        : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return          : none
 ******************************************************************************/
void usb_hcdc_read_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = mess->ip; /* Module number setting */
    ctrl.pipe = mess->keyword; /* Pipe number setting */
    if ((USB_CFG_HCDC_BULK_IN == ctrl.pipe) || (USB_CFG_HCDC_BULK_IN2 == ctrl.pipe))
    {
        ctrl.type = USB_HCDC; /* CDC Data class  */
    }

    else /* USB_CFG_HCDC_INT_IN */
    {
        ctrl.type = USB_HCDCC; /* CDC Control class  */
    }
    ctrl.address = usb_hstd_get_devsel(mess, ctrl.pipe) >> 12;
    ctrl.size = mess->read_req_len - mess->tranlen;                 /* Set Receive data length */

    switch (mess->status)
    {
        case USB_DATA_OK :
            ctrl.status = USB_SUCCESS;
        break;
        case USB_DATA_SHT :
            ctrl.status = USB_ERR_SHORT;
        break;
        case USB_DATA_OVR :
            ctrl.status = USB_ERR_OVER;
        break;
        case USB_DATA_ERR :
        default :
            ctrl.status = USB_ERR_NG;
        break;
    }
#if (BSP_CFG_RTOS_USED == 1)    /* FreeRTOS */
    ctrl.p_data = (void *)mess->task_id;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    usb_set_event(USB_STS_READ_COMPLETE, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hcdc_read_complete
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_write_complete
 Description     : CallBack Function
 Argument        : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return          : none
 ******************************************************************************/
void usb_hcdc_write_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = mess->ip;     /* Module number setting */
    ctrl.pipe = mess->keyword;  /* Pipe number setting */
    ctrl.type = USB_HCDC;       /* CDC Data class  */

    if (USB_DATA_NONE == mess->status)
    {
        ctrl.status = USB_SUCCESS;
    }
    else
    {
        ctrl.status = USB_ERR_NG;
    }
    ctrl.address = usb_hstd_get_devsel(mess, ctrl.pipe) >> 12;
#if (BSP_CFG_RTOS_USED == 1)     /* FreeRTOS */
    ctrl.p_data = (void *)mess->task_id;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    usb_set_event(USB_STS_WRITE_COMPLETE, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hcdc_write_complete
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_registration
 Description     : registration of Communications Devices class Driver
 Argument        : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
 Return          : none
 ******************************************************************************/
void usb_hcdc_registration (usb_utr_t *ptr)
{
    usb_hcdreg_t driver;
#if USB_CFG_HUB == USB_CFG_ENABLE
    uint8_t i;

#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */

    /* Driver registration */
#if USB_CFG_HCDC_IFCLS == USB_CFG_CDC
    driver.ifclass = (uint16_t) USB_IFCLS_CDC;                  /* CDC Communications Interface */

#else   /* USB_CFG_HCDC_IFCLS == USB_CFG_CDC */
    driver.ifclass = (uint16_t)USB_IFCLS_VEN;                   /* CDC Communications Interface */

#endif  /* USB_CFG_HCDC_IFCLS == USB_CFG_CDC */
    driver.p_tpl = (uint16_t*) &g_usb_hcdc_device_tpl; /* Target peripheral list */
    driver.classinit = (usb_cb_t) &usb_hcdc_init; /* Driver init */
    driver.classcheck = (usb_cb_check_t) &usb_hcdc_class_check; /* Driver check */
    driver.devconfig  = (usb_cb_t) &usb_hcdc_configured;        /* Device configuered */
    driver.devdetach  = (usb_cb_t) &usb_hcdc_detach;            /* Device detach */
    driver.devsuspend = (usb_cb_t) &usb_hstd_dummy_function;    /* Device suspend */
    driver.devresume  = (usb_cb_t) &usb_hstd_dummy_function;    /* Device resume */

#if USB_CFG_HUB == USB_CFG_ENABLE
    /* WAIT_LOOP */
    for (i = 0; i < USB_MAX_CONNECT_DEVICE_NUM; i++) /* Loop support CDC device count */
    {
        usb_hstd_driver_registration(ptr, &driver); /* Host CDC class driver registration. */
    }
#if (BSP_CFG_RTOS_USED == 0)              /* Non-OS */
    usb_cstd_set_task_pri(USB_HUB_TSK, USB_PRI_3); /* Hub Task Priority set */
#endif  /* (BSP_CFG_RTOS_USED == 0) */
    usb_hhub_registration(ptr, USB_NULL); /* Hub registration. */

#else   /* USB_CFG_HUB == USB_CFG_ENABLE */
    usb_hstd_driver_registration( ptr, &driver ); /* Host CDC class driver registration. */

#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */
}
/******************************************************************************
 End of function usb_hcdc_registration
 ******************************************************************************/

