TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HCDC/BDF_BCDF_USB_HCDC_CK_RX65N_V_2/src/smc_gen/r_usb_hcdc/src/r_usb_hcdc_driver.c
/******************************************************************************
 Function Name   : usb_hcdc_init
 Description     : Initialize of Host CDC driver.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : not use
                 : uint16_t     data2   : not use
 Return value    : none
 ******************************************************************************/
static void usb_hcdc_init (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    static uint8_t init = 0;

    if (0 == (init & (1 << ptr->ip)))
    {
        g_usb_hcdc_smpl_class_seq[ptr->ip] = 0;
        g_usb_hcdc_speed[ptr->ip] = 0;
        g_usb_hcdc_devaddr[ptr->ip] = 0;
        g_p_usb_hcdc_device_table[ptr->ip] = 0;
        g_p_usb_hcdc_config_table[ptr->ip] = 0;
        g_p_usb_hcdc_interface_table[ptr->ip] = 0;

        init |= (1 << ptr->ip);
    }
}
/******************************************************************************
 End of function usb_hcdc_init
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_class_check
 Description     : class check.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     **table : Pointer to data table.
 Return          : none
 ******************************************************************************/
void usb_hcdc_class_check (usb_utr_t *ptr, uint16_t **table)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t retval;
    uint16_t iproduct;
#else   /* (BSP_CFG_RTOS_USED) */
    usb_clsinfo_t *p_blf;
    usb_clsinfo_t *cp;
    usb_er_t err;
#endif  /* (BSP_CFG_RTOS_USED) */

    g_p_usb_hcdc_device_table[ptr->ip] = (uint8_t*) (table[0]); /* Set device descriptor address */
    g_p_usb_hcdc_config_table[ptr->ip] = (uint8_t*) (table[1]); /* Set configuration descriptor address */
    g_p_usb_hcdc_interface_table[ptr->ip] = (uint8_t*) (table[2]); /* Set interface descriptor address */
    g_usb_hcdc_speed[ptr->ip] = *table[6]; /* Set device connect speed */
    g_usb_hcdc_devaddr[ptr->ip] = *table[7]; /* Set device address */

    *table[3] = USB_OK; /* Set class check done  */

#if (BSP_CFG_RTOS_USED)
    /* Get String Descriptors */
    iproduct = g_p_usb_hcdc_device_table[ptr->ip][USB_DEV_I_PRODUCT];
    retval = usb_hcdc_get_string_info(ptr, g_usb_hcdc_devaddr[ptr->ip], iproduct);
    if (USB_OK != retval)
    {
        USB_PRINTF0("   GetDescriptor(String) failed!     \n");
        *table[3] = USB_ERROR;
        return;
    }
#else   /* (BSP_CFG_RTOS_USED) */
    g_usb_hcdc_smpl_class_seq[ptr->ip] = USB_SEQ_0; /* Initialize sequence number for enumeration */

    /* Get mem block from pool. */
    if ( USB_PGET_BLK(USB_HCDC_MPL, &p_blf) == USB_OK)
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = USB_MSG_CLS_CHECKREQUEST; /* Set message information: Check request */

        cp->ipp = ptr->ipp; /* IP address (USB0 or USB1) */
        cp->ip = ptr->ip; /* IP number(0or1) */

        /* Specify to perform next enumeration sequence to class function */
        err = USB_SND_MSG(USB_HCDC_MBX, (usb_msg_t* )cp);
        if (USB_OK != err)
        {
            USB_PRINTF1("Host Sample snd_msg error %x\n", err);
        }
    }
    else
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }
#endif  /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hcdc_class_check()
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_set_pipe_registration
 Description     : Host CDC pipe registration.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  devadr     : Device address
 Return          : usb_er_t             : Error info
 ******************************************************************************/
usb_er_t usb_hcdc_set_pipe_registration (usb_utr_t *ptr, uint16_t dev_addr)
{
    usb_er_t    err; /* Error code */
    uint8_t     pipe_no;

    err = USB_ERROR;

    /* Device address check */
    if (0 != dev_addr)
    {
        /* Search use pipe block */
        /* WAIT_LOOP */
        for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
        {   /* Check use block */
            if (USB_TRUE == g_usb_pipe_table[ptr->ip][pipe_no].use_flag)
            {   /* Check USB Device address */
                if ((dev_addr << USB_DEVADDRBIT) == (g_usb_pipe_table[ptr->ip][pipe_no].pipe_maxp & USB_DEVSEL))
                {
                    usb_hstd_set_pipe_reg (ptr, pipe_no);
                    err = USB_OK;
                }
            }
        }
    }
    else
    {
        /* Error */
        USB_PRINTF1("SmplOpen adr error %x\n", dev_addr);
    }
    return err;
}
/******************************************************************************
 End of function usb_hcdc_set_pipe_registration()
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hcdc_driver_start
 Description     : USB host Initialize process
 Arguments       : none
 Return          : none
 ******************************************************************************/
void usb_hcdc_driver_start (usb_utr_t *ptr)
{
    static uint8_t  is_init = USB_NO;

    g_usb_hcdc_smpl_class_seq[ptr->ip] = 0;
    g_usb_hcdc_speed[ptr->ip] = 0;
    g_usb_hcdc_devaddr[ptr->ip] = 0;
    g_p_usb_hcdc_device_table[ptr->ip] = 0;
    g_p_usb_hcdc_config_table[ptr->ip] = 0;
    g_p_usb_hcdc_interface_table[ptr->ip] = 0;

    if (USB_NO == is_init)
    {
        /* Set host CDC Task priority */
#if (BSP_CFG_RTOS_USED == 0)        /* Non-OS */
        usb_cstd_set_task_pri(USB_HCDC_TSK, USB_PRI_4);
#endif  /* (BSP_CFG_RTOS_USED == 0) */
        is_init = USB_YES;
    }
}
/******************************************************************************
 End of function usb_hcdc_driver_start()
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED)
/******************************************************************************
 Function Name   : usb_hcdc_get_string_info
 Description     : Get string descriptors.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t addr
                   uint16_t string
 Return value    : none
 ******************************************************************************/
uint16_t usb_hcdc_get_string_info(usb_utr_t *mess, uint16_t addr, uint16_t string)
{
    uint8_t *p_config_desc;
    uint16_t retval;
    uint8_t *p_desc;
    uint16_t desc_len;

    p_config_desc = g_p_usb_hcdc_config_table[mess->ip];

    if (USB_DT_CONFIGURATION != p_config_desc[1])
    {
        USB_PRINTF0("### Configuration descriptor error !\n");
        usb_hstd_connect_err_event_set(mess->ip);
        return USB_ERROR;
    }
    else
    {
        /* String descriptor */
        usb_hstd_get_string_desc(mess, g_usb_hcdc_devaddr[mess->ip], 0);
        g_usb_hcdc_smpl_class_seq[mess->ip]++;
    }

    /* String descriptor check */
    if (USB_CTRL_END == mess->result)
    {
        string = g_p_usb_hcdc_device_table[mess->ip][15];

        /* String descriptor */
        usb_hstd_get_string_desc(mess, g_usb_hcdc_devaddr[mess->ip], string);
        g_usb_hcdc_smpl_class_seq[mess->ip]++;
    }
    else /* USB_ERROR */
    {
        USB_PRINTF0("### Enumeration is stoped(ClassCode-ERROR)\n");
        usb_hstd_connect_err_event_set(mess->ip);
    }

    /* String descriptor check */
    if (USB_CTRL_END == mess->result)
    {
        if (g_usb_hstd_class_data[mess->ip][0] < (uint8_t) ((32 * 2) + 2))
        {
            g_usb_hstd_class_data[mess->ip][0] = (uint8_t) (g_usb_hstd_class_data[mess->ip][0] / 2);
            g_usb_hstd_class_data[mess->ip][0] = (uint8_t) (g_usb_hstd_class_data[mess->ip][0] - 1);
        }
        else
        {
            g_usb_hstd_class_data[mess->ip][0] = (uint8_t) 32;
        }

        /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
        for( j = (uint16_t)0; j < g_usb_hstd_class_data[mess->ip][0]; j++ )
        {
            p_data[j] = g_usb_hstd_class_data[mess->ip][j * (uint16_t)2 + (uint16_t)2];
        }
        p_data[g_usb_hstd_class_data[mess->ip][0]] = 0;
        USB_PRINTF1("  %s\n", p_data);
#endif  /* defined(USB_DEBUG_ON) */
    }
    else
    {
        USB_PRINTF0("*** Product name error\n");
    }

    p_desc = (uint8_t *) g_usb_hstd_config_descriptor[mess->ip];
    desc_len = ((uint16_t) *(p_desc + 3)) << 8;
    desc_len += (uint16_t) *(p_desc + 2);

    /* Pipe Information table set */
    retval = usb_hcdc_pipe_info(mess, p_desc, g_usb_hcdc_speed[mess->ip], desc_len);
    if (USB_ERROR == retval)
    {
        /* Pipe Information table error */
        USB_PRINTF0("### Device information error !\n");
        usb_hstd_connect_err_event_set(mess->ip);
    }
    else
    {
        retval = USB_OK;
    }

    return retval;
} /* End of function usb_hcdc_get_string_info() */

#endif /* (BSP_CFG_RTOS_USED) */

  #endif /* BSP_CFG_RTOS_USED != 5 !Azure RTOS */
#endif /* defined(USB_CFG_HCDC_USE) */
/******************************************************************************
 End  Of File
 ******************************************************************************/
